forwardStep/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

x1 0.0;
x2 10.0;
x3 20.0;
x4 30.0;

y1 0.0;
y2 1.0;
y3 2.0;
y4 3.0;
y5 4.0;
y6 5.0;
y7 6.0;
y8 7.0;

z1 0.0;
z2 1.0;

xinlet 10;
xnear 50;

yfine 30;
yfar 10;

vertices
(
    ($x1 $y3 $z1) //0
    ($x1 $y6 $z1) //1

    ($x2 $y4 $z1) //2
    ($x2 $y5 $z1) //3


    ($x3 $y1 $z1)//4
    ($x3 $y2 $z1)//5
    ($x3 $y7 $z1)//6
    ($x3 $y8 $z1)//7

    ($x4 $y1 $z1)//8
    ($x4 $y2 $z1)//9
    ($x4 $y7 $z1)//10
    ($x4 $y8 $z1)//11



    ($x1 $y3 $z2) //0
    ($x1 $y6 $z2) //1

    ($x2 $y4 $z2) //2
    ($x2 $y5 $z2) //3

    ($x3 $y1 $z2)//4
    ($x3 $y2 $z2)//5
    ($x3 $y7 $z2)//6
    ($x3 $y8 $z2)//7

    ($x4 $y1 $z2)//8
    ($x4 $y2 $z2)//9
    ($x4 $y7 $z2)//10
    ($x4 $y8 $z2)//11



);

blocks
(
    hex (0 2 3 1 12 14 15 13) ($xinlet $yfine 1) simpleGrading (0.2 1 1)
    hex (2 5 6 3 14 17 18 15) ($xnear  $yfine 1) simpleGrading (0.2 1 1)
    hex (5 9 10 6 17 21 22 18) ($xnear  $yfine 1) simpleGrading (5 1 1)

    hex (4 8 9 5 16 20 21 17) ($xnear $yfar 1) simpleGrading (5 0.5 1)
    hex (6 10 11 7 18 22 23 19) ($xnear $yfar 1) simpleGrading (5 2 1)
);

edges
(
);


boundary
(
    inlet
    {
        type wall;
        faces
        (
         (0 1 12 13)
        );
    }

    wall
    {
        type slip;
        faces
        (
         (0 2 14 12)
         (2 5 14 17)
         (1 3 13 15)
         (3 6 15 18)
        );
    }

        outlet
    {
        type wall;
        faces
        (
            (6 7 18 19)
            (7 11 19 23)
            (11 10 23 22)
            (10 9 22 21)
            (9 8 21 20)
            (4 8 16 20)
            (4 5 16 17)
        );
    }

            empty
    {
        type empty;
        faces
        (
            (1 3 2 0)
            (3 6 5 2)
            (7 11 10 6)
            (6 10 9 5)
            (5 9 8 4)

            (13 15 14 12)
            (15 18 17 14)
            (19 23 22 18)
            (18 22 21 17)
            (17 21 20 16)
        );
    }
    

/*
    ceiling
    {
        type wall;
        faces
        (
            (4 5 6 7)
        );
    }

    left
    {
        type wall;
        faces
        (
            (0 4 7 3)
        );
    }

    right
    {
        type wall;
        faces
        (
            (2 6 5 1)
        );
    }

    frontAndBack
    {
        type empty;
        faces
        (
(3 7 6 2)
(1 5 4 0)
        );
    }
    */
);

mergePatchPairs
(
);

// ************************************************************************* //
